app/views/projects/show.html.erb

SELECT  "user_projects".* FROM "user_projects" WHERE "user_projects"."user_id" IS NULL AND "user_projects"."project_id" = 1  ORDER BY "user_projects"."id" ASC LIMIT 1
SELECT COUNT(*) FROM "user_projects" WHERE "user_projects"."user_id" IS NULL AND "user_projects"."project_id" = 1
---

		<% if UserProject.where(:user => session[:user_id], :project => @project).count == 0 %>