app/controllers/projects_controller.rb

    def show
        @project = Project.find(params[:id])
        @user_project = UserProject.where(user: session[:user_id], project: @project).first
---
SELECT  "projects".* FROM "projects" WHERE "projects"."id" = ? LIMIT 1  [["id", 1]]
SELECT  "user_projects".* FROM "user_projects" WHERE "user_projects"."user_id" IS NULL AND "user_projects"."project_id" = 1  ORDER BY "user_projects"."id" ASC LIMIT 1

    def start
        @project = Project.find(params[:id])
        user_project_boolean = UserProject.where(user: session[:user_id], project: @project).first
        user_project_boolean.update(project_started: true)
---
SELECT  "projects".* FROM "projects" WHERE "projects"."id" = ? LIMIT 1  [["id", 3]]
SELECT  "user_projects".* FROM "user_projects" WHERE "user_projects"."user_id" = 6 AND "user_projects"."project_id" = 3  ORDER BY "user_projects"."id" ASC LIMIT 1
UPDATE "user_projects" SET "project_started" = ?, "updated_at" = ? WHERE "user_projects"."id" = ?  [["project_started", "t"], ["updated_at", "2023-11-14 08:12:01.458921"], ["id", 5]]

    def index
        #id = params[:id]
        #@user = User.find(1)
        language = session[:language]
        tech_area = session[:tech_area]
        tech_stack = session[:tech_stack]
        skill_level = session[:skill_level]
        project_scale = session[:project_scale]
        if language == nil
            @projects = Project.all
            @user_project = UserProject.where(user: session[:user_id], project: @project).first
        else
            @projects = Project.where(language: language, :tech_area => tech_area, :tech_stack => tech_stack, :skill_level => skill_level, :project_scale => project_scale)
---
SELECT "projects".* FROM "projects"
SELECT  "user_projects".* FROM "user_projects" WHERE "user_projects"."user_id" IS NULL AND "user_projects"."project_id" IS NULL  ORDER BY "user_projects"."id" ASC LIMIT 1
SELECT "projects".* FROM "projects" WHERE "projects"."language" = ? AND "projects"."tech_area" = ? AND "projects"."tech_stack" = ? AND "projects"."skill_level" = ? AND "projects"."project_scale" = ?  [["language", "python"], ["tech_area", "data-science"], ["tech_stack", "pandas"], ["skill_level", "beginner"], ["project_scale", "10"]]