app/controllers/user_projects_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 6]]
SELECT  "projects".* FROM "projects" WHERE "projects"."id" = ? LIMIT 1  [["id", 5]]
INSERT INTO "user_projects" ("user_id", "project_id", "process", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["user_id", 6], ["project_id", 5], ["process", 0], ["created_at", "2023-11-14 01:52:44.460295"], ["updated_at", "2023-11-14 01:52:44.460295"]]
---
    def create
        user_id = session[:user_id]
        project_id = params[:project_id]
        @user = User.find(user_id)
        @project = Project.find(project_id)
        # @user_project = UserProject.where(:user => @user, :project => @project).first
        @user_project = UserProject.create!(:user => @user, :project => @project, :process => 0)