app/controllers/users_controller.rb

    def create
        user = User.new(user_params)
        if user.save
---
INSERT INTO "users" ("name", "email", "password_digest", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)

    def show
        if session[:user_id] == nil
            redirect_to '/'
        end
        id = session[:user_id]
        if params[:id] != id.to_s
            redirect_to user_path(id)
        # session[:id] = id
        end
        @user = User.find(id)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 6]]

    def update
        @user = User.find(params[:id])
        @project = Project.find(params[:project])
        @user_project = UserProject.where(:user => @user, :project => @project).first
        @user_project.update_attributes(process: params[:process])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 7]]
SELECT  "user_projects".* FROM "user_projects" WHERE "user_projects"."user_id" = 7 AND "user_projects"."project_id" = 1  ORDER BY "user_projects"."id" ASC LIMIT 1
UPDATE "user_projects" SET "process" = ?, "updated_at" = ? WHERE "user_projects"."id" = ?  [["process", 100], ["updated_at", "2023-11-14 22:38:24.774316"], ["id", 5]]